Revit 2026 API

# SelectionFilterElementSetElementIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetElementIds(
	ICollection<ElementId> ids
)
```
```vb
Public Sub SetElementIds (
	ids As ICollection(Of ElementId)
)
```
```cpp
public:
void SetElementIds(
	ICollection<ElementId^>^ ids
)
```
```fsharp
member SetElementIds :
        ids : ICollection<ElementId> -> unit
```

#### Parameters

ids ICollectionElementId

#### Reference

SelectionFilterElement Class

Autodesk.Revit.DB Namespace